posts/1910-WSL2-automatic-display.org
#+TITLE: Setting up WSL2 xserver display
#+DATE: <2019-11-11 Mon>

* WSL2 DISPLAY xserver

** TL;DR
   add this line to your =~/.bashrc= file (in the WSL2 machine)
   #+BEGIN_SRC sh
export DISPLAY="$(cat /etc/resolv.conf | grep -Po "nameserver \K[0-9.]+"):0"
   #+END_SRC

   And install [[https://sourceforge.net/projects/vcxsrv/][VcXsrv]] in your windows machine
  
** Windows host IP
   The windows host ip can be found by running
   #+BEGIN_SRC sh
cat /etc/resolv.conf
   #+END_SRC
   This gives something like
   #+BEGIN_SRC conf
# This file was automatically generated by WSL. To stop automatic generation of this file, add the following entry to /etc/wsl.conf:
# [network]
# generateResolvConf = false
nameserver 172.20.112.1
   #+END_SRC

   Now, to programmatically get this ip we run
   #+BEGIN_SRC sh
cat /etc/resolv.conf | grep -Po "nameserver \K[0-9.]+"
   #+END_SRC

