posts/1910-WSL2-automatic-display.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-21 Tue 14:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Setting up WSL2 xserver display</title>
<meta name="generator" content="Org mode" />
<link rel='stylesheet' type='text/css' href='../css/default.css' />
<link rel='stylesheet' type='text/css' href='../css/style.css' />
<link rel='stylesheet' type='text/css' href='../css/code.css' />
<meta name='viewport' content='width=device-width, initial-scale=1.0' />

</head>
<body>
<div id="preamble" class="status">
<div class="header">
  <a href="../index.html">
    <span class="actondev act">ACT</span><span class="actondev on">ON</span><span class="actondev dev">DEV</span>
  </a>
  <span>Development, philosophy, writing</span>
</div>
<h1 class='title'>Setting up WSL2 xserver display<br/><span class='subtitle date'>2019-11-11</span></h1>
</div>
<div id="content">

<div id="outline-container-orgc83d7cf" class="outline-2">
<h2 id="orgc83d7cf">WSL2 DISPLAY xserver</h2>
<div class="outline-text-2" id="text-orgc83d7cf">
</div>
<div id="outline-container-orgd791d8b" class="outline-3">
<h3 id="orgd791d8b">TL;DR</h3>
<div class="outline-text-3" id="text-orgd791d8b">
<p>
add this line to your <code>~/.bashrc</code> file (in the WSL2 machine)
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #fd971f;">export</span> <span style="color: #fd971f;">DISPLAY</span>=<span style="color: #e2c770;">"$(cat /etc/resolv.conf | grep -Po "nameserver \K[0-9.]+"):0"</span>
</pre>
</div>

<p>
And install <a href="https://sourceforge.net/projects/vcxsrv/">VcXsrv</a> in your windows machine
</p>
</div>
</div>

<div id="outline-container-orgde21517" class="outline-3">
<h3 id="orgde21517">Windows host IP</h3>
<div class="outline-text-3" id="text-orgde21517">
<p>
The windows host ip can be found by running
</p>
<div class="org-src-container">
<pre class="src src-sh">cat /etc/resolv.conf
</pre>
</div>
<p>
This gives something like
</p>
<div class="org-src-container">
<pre class="src src-conf"># This file was automatically generated by WSL. To stop automatic generation of this file, add the following entry to /etc/wsl.conf:
# [network]
<span style="color: #fd971f;"># generateResolvConf</span> = false
nameserver 172.20.112.1
</pre>
</div>

<p>
Now, to programmatically get this ip we run
</p>
<div class="org-src-container">
<pre class="src src-sh">cat /etc/resolv.conf | grep -Po <span style="color: #e2c770;">"nameserver \K[0-9.]+"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<h2>Comments</h2>
Leave your comments below

<div id="disqus_thread"></div>
<script>
  var disqus_config = function () {
  this.page.url = "";  // Replace PAGE_URL with your page's canonical URL variable
  this.page.identifier = "1910-WSL2-automatic-display"; // Replace PAGE_IDENTIFIER with your page's unique identifier variable
  };
  
  (function() { // DON'T EDIT BELOW THIS LINE
  var d = document, s = d.createElement('script');
  s.src = 'https://actondev-blog.disqus.com/embed.js';
  s.setAttribute('data-timestamp', +new Date());
  (d.head || d.body).appendChild(s);
  })();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</body>
</html>
